In [3]:
import pandas as pd

In [4]:
base= pd.read_csv('credit_data.csv')

In [5]:
base.head()

   clientid        income        age         loan  default
0         1  66155.925095  59.017015  8106.532131        0
1         2  34415.153966  48.117153  6564.745018        0
2         3  57317.170063  63.108049  8020.953296        0
3         4  42709.534201  45.751972  6103.642260        0
4         5  66952.688845  18.584336  8770.099235        1

In [6]:
base.describe()

          clientid        income          age          loan      default
count  2000.000000   2000.000000  1997.000000   2000.000000  2000.000000
mean   1000.500000  45331.600018    40.807559   4444.369695     0.141500
std     577.494589  14326.327119    13.624469   3045.410024     0.348624
min       1.000000  20014.489470   -52.423280      1.377630     0.000000
25%     500.750000  32796.459717    28.990415   1939.708847     0.000000
50%    1000.500000  45789.117313    41.317159   3974.719419     0.000000
75%    1500.250000  57791.281668    52.587040   6432.410625     0.000000
max    2000.000000  69995.685578    63.971796  13766.051239     1.000000

In [7]:
base.loc[base['age']<0]

    clientid        income        age         loan  default
15        16  50501.726689 -28.218361  3977.287432        0
21        22  32197.620701 -52.423280  4244.057136        0
26        27  63287.038908 -36.496976  9595.286289        0

In [8]:
#4 formas de corrigir
#forma 4 preencher os valores com a média

base.mean() #retorna todas as médias

clientid     1000.500000
income      45331.600018
age            40.807559
loan         4444.369695
default         0.141500
dtype: float64

In [9]:
base['age'].mean() # não esta desconsiderando  as idades negativas da conta

40.80755937840458

In [10]:
base['age'][base.age>0].mean()

40.92770044906149

In [11]:
base.loc[base.age<0,'age']=40.92 #substitui os valores negativos pela media encontrada
base.loc[base['age']<0]

Empty DataFrame
Columns: [clientid, income, age, loan, default]
Index: []

In [12]:
pd.isnull(base['age'])

0       False
1       False
2       False
3       False
4       False
5       False
6       False
7       False
8       False
9       False
10      False
11      False
12      False
13      False
14      False
15      False
16      False
17      False
18      False
19      False
20      False
21      False
22      False
23      False
24      False
25      False
26      False
27      False
28       True
29      False
        ...
1970    False
1971    False
1972    False
1973    False
1974    False
1975    False
1976    False
1977    False
1978    False
1979    False
1980    False
1981    False
1982    False
1983    False
1984    False
1985    False
1986    False
1987    False
1988    False
1989    False
1990    False
1991    False
1992    False
1993    False
1994    False
1995    False
1996    False
1997    False
1998    False
1999    False
Name: age, Length: 2000, dtype: bool

In [13]:
base.loc[pd.isnull(base['age'])]

    clientid        income  age         loan  default
28        29  59417.805406  NaN  2082.625938        0
30        31  48528.852796  NaN  6155.784670        0
31        32  23526.302555  NaN  2862.010139        0

In [14]:
base['age']

0       59.017015
1       48.117153
2       63.108049
3       45.751972
4       18.584336
5       57.471607
6       26.809132
7       32.897548
8       55.496853
9       39.776378
10      25.679575
11      60.471936
12      26.355044
13      61.576776
14      39.201553
15      40.920000
16      39.574530
17      60.848318
18      61.690571
19      26.076093
20      31.761354
21      40.920000
22      48.576975
23      51.970624
24      48.840922
25      27.031741
26      40.920000
27      55.839922
28            NaN
29      54.510948
          ...
1970    47.694520
1971    30.308184
1972    54.969313
1973    47.466485
1974    31.344048
1975    54.235915
1976    47.604402
1977    31.192627
1978    40.518963
1979    48.148404
1980    52.580773
1981    43.999461
1982    45.993199
1983    33.327144
1984    60.886966
1985    39.142225
1986    38.622259
1987    20.542409
1988    24.270612
1989    25.252609
1990    34.101654
1991    45.539385
1992    23.250084
1993    26.821928
1994    37.751622
1995    48.518179
1996    23.162104
1997    28.017167
1998    63.971796
1999    56.152617
Name: age, Length: 2000, dtype: float64